{
  "education": [
    {
      "awards_achievements": [
        "Dean's Honour Roll (3-time recipient): 2021, 2022, 2024"
      ],
      "degree": "Bachelor of Science (Honours)",
      "department": "Computer Science, Software Engineering Specialization",
      "duration": "Sep 2020 – Apr 2025",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SalmanChowdhury/",
  "highlighted_projects": [
    {
      "description": "Collaborated in a team of 3 to develop a student performance prediction system using Linear Regression and Random Forest models, achieving 84.3% R² score and 92% F1-Score respectively. Built an ML pipeline implementing data encoding and normalization which improved model performance through systematic preprocessing optimization. Developed Flask backend API routes and crafted an interactive React visualization dashboard with 3 chart types displaying predicted scores and feature comparisons.",
      "git_url": "https://github.com/Mitch-Buchanan/Predicting-Student-Performance-COMP-4990",
      "name": "Student Performance Predictor"
    },
    {
      "description": "Built a full-stack job portal using Next.js, TypeScript, and PostgreSQL that allows users to browse, filter, and post job listings. Implemented RESTful API architecture with server-side route handlers, error handling, and Zod schema data validation. Designed a responsive UI with Tailwind CSS and Shadcn-UI, optimized database operations using Prisma ORM improving data retrieval speed by 20%, and developed an admin approval system with Clerk authentication.",
      "git_url": "https://www.nerdy-jobs.schowdhury.online",
      "name": "Nerdy Jobs - Full-Stack Job Portal"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster monitoring system using Bash scripts and PostgreSQL to automatically collect and store hardware specifications and resource usage data from multiple nodes in a cluster. Implemented automated data collection through cron jobs and created SQL queries for system performance analysis and monitoring.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Salman Chowdhury",
  "others": [
    {
      "bullets": [
        "Supervised Machine Learning: Regression and Classification (Coursera 2024)",
        "Career Essentials in System Administration by Microsoft and LinkedIn (LinkedIn Learning 2022)",
        "DevOps Foundations (LinkedIn Learning 2016)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "English (Native)",
        "French (Native)"
      ],
      "title": "Languages"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Develop data engineering solutions and applications using Java, Python, and various database technologies. Collaborate with team members on agile development projects including Linux system monitoring, core Java applications, and cloud-based data processing systems. Apply software development best practices including version control with Git, code review processes, and automated testing methodologies.",
      "duration": "2025-present",
      "title": "Data Engineer"
    },
    {
      "company": "Glendor",
      "description": "Created standardized testing procedures in Python and Google Colab to evaluate and compare performance metrics across 10 open-source face detection models, focusing on occlusion handling in medical environments. Developed a comprehensive ensemble face detection system that achieved 92% F1 score, integrating the top 4 best performing models. Implemented bounding box fusion using an IoU-based algorithm and confidence-weighted averaging, achieving over 99.7% precision by significantly reducing false positives.",
      "duration": "Jan 2025 – Apr 2025",
      "title": "AI Intern"
    },
    {
      "company": "FGF Brands",
      "description": "Provided Level 1 and 2 helpdesk support to resolve IT issues for employees, achieving a 95% resolution rate within 24 hours. Managed time management systems and access control privileges for 3,000+ employees across 13 locations. Administered shift schedules and attendance records using Workforce Software and Active Directory, improving schedule accuracy by 15% and reducing absenteeism by 10%.",
      "duration": "Jan 2023 – Aug 2023",
      "title": "System Administrator Co-op"
    }
  ],
  "skills": {
    "competent": [
      "React/Next.js",
      "Node.js",
      "Linux/Bash",
      "Docker",
      "Google Cloud Platform"
    ],
    "familiar": [
      "Flask",
      "TypeScript",
      "C/C++",
      "MongoDB",
      "PyTorch"
    ],
    "proficient": [
      "Python",
      "JavaScript",
      "Java",
      "SQL/PostgreSQL/MySQL",
      "Git/GitHub"
    ]
  },
  "summary": "I am a recent graduate in Computer Science from the University of Windsor, specializing in Software Engineering. I have hands-on experience in full-stack web development, system administration, and AI/ML development. My recent AI internship at Glendor involved developing ensemble face detection systems, achieving a 92% F1 score, and implementing advanced algorithms for medical video analysis. I'm passionate about leveraging data and technology to solve real-world problems, from building intelligent systems that enhance user experiences to creating scalable applications that drive business value. My diverse experience across web development, IT operations, and AI provides me with a unique perspective on how technology can transform industries and enhance people's lives."
}
